AntoineMugnier/mutekh/arch/cc26xx/include/arch/cc26xx/ioc.h
/***************************************
* Auto generated by BFGen, do not edit *
***************************************/

/*
   bfgen -o cdefs -I defs/cc26xx/ioc.bf cdefs_use_reg_comment=0                \
     cdefs_use_field_comment=0 cdefs_use_field_get=2 cdefs_use_field_set=2     \
     cdefs_use_field_shift=1 cdefs_use_field_shifted_mask=1                    \
     cdefs_use_field_shifter=0 cdefs_use_reg_comment=0                         \
     cdefs_use_value_comment=0 doc_field_doc_column=0                          \
     doc_field_longname_column=0 doc_lsb_on_left=0 doc_reg_address_column=0    \
     doc_reg_direction_column=0 doc_reg_doc_column=0 doc_reg_longname_column=0 \
     doc_split_width=0
*/

#ifndef _CC26XX_IOC_BFGEN_DEFS_
#define _CC26XX_IOC_BFGEN_DEFS_

#define CC26XX_IOC_IOCFG_ADDR(ridx)                  (0x00000000 + (ridx) * 4)
#define CC26XX_IOC_IOCFG_COUNT                       32
  #define CC26XX_IOC_IOCFG_PORT_ID                 0x0000003f
  #define CC26XX_IOC_IOCFG_PORT_ID_SHIFT           0
  #define CC26XX_IOC_IOCFG_PORT_ID_SET(x, v)       do { (x) = (((x) & ~0x3f) | ((CC26XX_IOC_IOCFG_PORT_ID_##v) << 0)); } while(0)
  #define CC26XX_IOC_IOCFG_PORT_ID_GET(x)          (((x) >> 0) & 0x3f)
    #define CC26XX_IOC_IOCFG_PORT_ID_GPIO            0x00000000
    #define CC26XX_IOC_IOCFG_PORT_ID_AON_CLK32K      0x00000007
    #define CC26XX_IOC_IOCFG_PORT_ID_AUX_IO          0x00000008
    #define CC26XX_IOC_IOCFG_PORT_ID_SSI0_RX         0x00000009
    #define CC26XX_IOC_IOCFG_PORT_ID_SSI0_TX         0x0000000a
    #define CC26XX_IOC_IOCFG_PORT_ID_SSI0_FSS        0x0000000b
    #define CC26XX_IOC_IOCFG_PORT_ID_SSI0_CLK        0x0000000c
    #define CC26XX_IOC_IOCFG_PORT_ID_I2C_MSSDA       0x0000000d
    #define CC26XX_IOC_IOCFG_PORT_ID_I2C_MSSCL       0x0000000e
    #define CC26XX_IOC_IOCFG_PORT_ID_UART0_RX        0x0000000f
    #define CC26XX_IOC_IOCFG_PORT_ID_UART0_TX        0x00000010
    #define CC26XX_IOC_IOCFG_PORT_ID_UART0_CTS       0x00000011
    #define CC26XX_IOC_IOCFG_PORT_ID_UART0_RTS       0x00000012
    #define CC26XX_IOC_IOCFG_PORT_ID_PORT_EVENT0     0x00000017
    #define CC26XX_IOC_IOCFG_PORT_ID_PORT_EVENT1     0x00000018
    #define CC26XX_IOC_IOCFG_PORT_ID_PORT_EVENT2     0x00000019
    #define CC26XX_IOC_IOCFG_PORT_ID_PORT_EVENT3     0x0000001a
    #define CC26XX_IOC_IOCFG_PORT_ID_PORT_EVENT4     0x0000001b
    #define CC26XX_IOC_IOCFG_PORT_ID_PORT_EVENT5     0x0000001c
    #define CC26XX_IOC_IOCFG_PORT_ID_PORT_EVENT6     0x0000001d
    #define CC26XX_IOC_IOCFG_PORT_ID_PORT_EVENT7     0x0000001e
    #define CC26XX_IOC_IOCFG_PORT_ID_CPU_SWV         0x00000020
    #define CC26XX_IOC_IOCFG_PORT_ID_SSI1_RX         0x00000021
    #define CC26XX_IOC_IOCFG_PORT_ID_SSI1_TX         0x00000022
    #define CC26XX_IOC_IOCFG_PORT_ID_SSI1_FSS        0x00000023
    #define CC26XX_IOC_IOCFG_PORT_ID_SSI1_CLK        0x00000024
    #define CC26XX_IOC_IOCFG_PORT_ID_I2S_AD0         0x00000025
    #define CC26XX_IOC_IOCFG_PORT_ID_I2S_AD1         0x00000026
    #define CC26XX_IOC_IOCFG_PORT_ID_I2S_WCLK        0x00000027
    #define CC26XX_IOC_IOCFG_PORT_ID_I2S_BCLK        0x00000028
    #define CC26XX_IOC_IOCFG_PORT_ID_I2S_MCLK        0x00000029
    #define CC26XX_IOC_IOCFG_PORT_ID_RFC_TRC         0x0000002e
    #define CC26XX_IOC_IOCFG_PORT_ID_RFC_GPO0        0x0000002f
    #define CC26XX_IOC_IOCFG_PORT_ID_RFC_GPO1        0x00000030
    #define CC26XX_IOC_IOCFG_PORT_ID_RFC_GPO2        0x00000031
    #define CC26XX_IOC_IOCFG_PORT_ID_RFC_GPO3        0x00000032
    #define CC26XX_IOC_IOCFG_PORT_ID_RFC_GPI0        0x00000033
    #define CC26XX_IOC_IOCFG_PORT_ID_RFC_GPI1        0x00000034
    #define CC26XX_IOC_IOCFG_PORT_ID_RFC_SMI_DL_OUT  0x00000035
    #define CC26XX_IOC_IOCFG_PORT_ID_RFC_SMI_DL_IN   0x00000036
    #define CC26XX_IOC_IOCFG_PORT_ID_RFC_SMI_CL_OUT  0x00000037
    #define CC26XX_IOC_IOCFG_PORT_ID_RFC_SMI_CL_IN   0x00000038
  #define CC26XX_IOC_IOCFG_RESERVED6               0x000000c0
  #define CC26XX_IOC_IOCFG_RESERVED6_SHIFT         6
  #define CC26XX_IOC_IOCFG_RESERVED6_SET(x, v)     do { (x) = (((x) & ~0xc0) | ((v) << 6)); } while(0)
  #define CC26XX_IOC_IOCFG_RESERVED6_GET(x)        (((x) >> 6) & 0x3)
  #define CC26XX_IOC_IOCFG_IOSTR                   0x00000300
  #define CC26XX_IOC_IOCFG_IOSTR_SHIFT             8
  #define CC26XX_IOC_IOCFG_IOSTR_SET(x, v)         do { (x) = (((x) & ~0x300) | ((CC26XX_IOC_IOCFG_IOSTR_##v) << 8)); } while(0)
  #define CC26XX_IOC_IOCFG_IOSTR_GET(x)            (((x) >> 8) & 0x3)
    #define CC26XX_IOC_IOCFG_IOSTR_AUTO              0x00000000
    #define CC26XX_IOC_IOCFG_IOSTR_MIN               0x00000001
    #define CC26XX_IOC_IOCFG_IOSTR_MED               0x00000002
    #define CC26XX_IOC_IOCFG_IOSTR_MAX               0x00000003
  #define CC26XX_IOC_IOCFG_IOCURR                  0x00000c00
  #define CC26XX_IOC_IOCFG_IOCURR_SHIFT            10
  #define CC26XX_IOC_IOCFG_IOCURR_SET(x, v)        do { (x) = (((x) & ~0xc00) | ((CC26XX_IOC_IOCFG_IOCURR_##v) << 10)); } while(0)
  #define CC26XX_IOC_IOCFG_IOCURR_GET(x)           (((x) >> 10) & 0x3)
    #define CC26XX_IOC_IOCFG_IOCURR_2MA              0x00000000
    #define CC26XX_IOC_IOCFG_IOCURR_4MA              0x00000001
    #define CC26XX_IOC_IOCFG_IOCURR_4_8MA            0x00000002
  #define CC26XX_IOC_IOCFG_SLEW_RED                0x00001000
  #define CC26XX_IOC_IOCFG_SLEW_RED_SHIFT          12
  #define CC26XX_IOC_IOCFG_PULL_CTL                0x00006000
  #define CC26XX_IOC_IOCFG_PULL_CTL_SHIFT          13
  #define CC26XX_IOC_IOCFG_PULL_CTL_SET(x, v)      do { (x) = (((x) & ~0x6000) | ((CC26XX_IOC_IOCFG_PULL_CTL_##v) << 13)); } while(0)
  #define CC26XX_IOC_IOCFG_PULL_CTL_GET(x)         (((x) >> 13) & 0x3)
    #define CC26XX_IOC_IOCFG_PULL_CTL_DWN            0x00000001
    #define CC26XX_IOC_IOCFG_PULL_CTL_UP             0x00000002
    #define CC26XX_IOC_IOCFG_PULL_CTL_DIS            0x00000003
  #define CC26XX_IOC_IOCFG_RESERVED15              0x00008000
  #define CC26XX_IOC_IOCFG_RESERVED15_SHIFT        15
  #define CC26XX_IOC_IOCFG_EDGE_DET                0x00030000
  #define CC26XX_IOC_IOCFG_EDGE_DET_SHIFT          16
  #define CC26XX_IOC_IOCFG_EDGE_DET_SET(x, v)      do { (x) = (((x) & ~0x30000) | ((CC26XX_IOC_IOCFG_EDGE_DET_##v) << 16)); } while(0)
  #define CC26XX_IOC_IOCFG_EDGE_DET_GET(x)         (((x) >> 16) & 0x3)
    #define CC26XX_IOC_IOCFG_EDGE_DET_NONE           0x00000000
    #define CC26XX_IOC_IOCFG_EDGE_DET_NEG            0x00000001
    #define CC26XX_IOC_IOCFG_EDGE_DET_POS            0x00000002
    #define CC26XX_IOC_IOCFG_EDGE_DET_BOTH           0x00000003
  #define CC26XX_IOC_IOCFG_EDGE_IRQ_EN             0x00040000
  #define CC26XX_IOC_IOCFG_EDGE_IRQ_EN_SHIFT       18
  #define CC26XX_IOC_IOCFG_RESERVED19              0x00f80000
  #define CC26XX_IOC_IOCFG_RESERVED19_SHIFT        19
  #define CC26XX_IOC_IOCFG_RESERVED19_SET(x, v)    do { (x) = (((x) & ~0xf80000) | ((v) << 19)); } while(0)
  #define CC26XX_IOC_IOCFG_RESERVED19_GET(x)       (((x) >> 19) & 0x1f)
  #define CC26XX_IOC_IOCFG_IOMODE                  0x07000000
  #define CC26XX_IOC_IOCFG_IOMODE_SHIFT            24
  #define CC26XX_IOC_IOCFG_IOMODE_SET(x, v)        do { (x) = (((x) & ~0x7000000) | ((CC26XX_IOC_IOCFG_IOMODE_##v) << 24)); } while(0)
  #define CC26XX_IOC_IOCFG_IOMODE_GET(x)           (((x) >> 24) & 0x7)
    #define CC26XX_IOC_IOCFG_IOMODE_NORMAL           0x00000000
    #define CC26XX_IOC_IOCFG_IOMODE_INV              0x00000001
    #define CC26XX_IOC_IOCFG_IOMODE_OPENDR           0x00000004
    #define CC26XX_IOC_IOCFG_IOMODE_OPENDR_INV       0x00000005
    #define CC26XX_IOC_IOCFG_IOMODE_OPENSRC          0x00000006
    #define CC26XX_IOC_IOCFG_IOMODE_OPENSRC_INV      0x00000007
  #define CC26XX_IOC_IOCFG_WU_CFG                  0x18000000
  #define CC26XX_IOC_IOCFG_WU_CFG_SHIFT            27
  #define CC26XX_IOC_IOCFG_WU_CFG_SET(x, v)        do { (x) = (((x) & ~0x18000000) | ((v) << 27)); } while(0)
  #define CC26XX_IOC_IOCFG_WU_CFG_GET(x)           (((x) >> 27) & 0x3)
  #define CC26XX_IOC_IOCFG_IE                      0x20000000
  #define CC26XX_IOC_IOCFG_IE_SHIFT                29
  #define CC26XX_IOC_IOCFG_HYST_EN                 0x40000000
  #define CC26XX_IOC_IOCFG_HYST_EN_SHIFT           30
  #define CC26XX_IOC_IOCFG_RESERVED31              0x80000000
  #define CC26XX_IOC_IOCFG_RESERVED31_SHIFT        31

#endif

